#ตัวดำเนินการกำหนดค่า
# -*- coding: utf-8 -*-

x,y=10,2
print("x = ",x)
print("y = ",y)

x=x+y #10+2 =12จะถูกเก็บลงในตัวแปร x
print("ผลลัพธ์ = ",x)
print("===================")
#เขียนแบบกระชับ
x+=y 
print("ผลลัพธ์+ = ",x)
print("===================")
x-=y
print("ผลลัพธ์- = ",x)
print("===================")
x*=y
print("ผลลัพธ์* = ",x)
print("===================")
x/=y
print("ผลลัพธ์/ = ",x)
print("===================")
x**=y
print("ผลลัพธ์** = ",x)
print("===================")
x%=y
print("ผลลัพธ์% = ",x)
print("===================")

