#ฟังก์ชั้นจัดการ String

name="Pawarisa"

#แบบธรรมดา
print(name,"(แบบธรรมดา)")

#แปลงเป็นตัวพิมพ์ใหญ่
print(name.upper(),"(แปลงเป็นตัวพิมพ์ใหญ่)")

#แปลงเป็นตัวพิมพ์เล็ก
print(name.lower(),"(แปลงเป็นตัวพิมพ์เล็ก)")

#แปลงเป็นตัวพิมพ์ใหญ่และตัวพิมพ์เล็ก
print(name.swapcase(),"(แปลงเป็นตัวพิมพ์ใหญ่และตัวพิมพ์เล็ก)")

#แปลงเป็นตัวพิมพ์เล็กและตัวพิมพ์ใหญ่
print(name.capitalize(),"(แปลงเป็นตัวพิมพ์เล็กและตัวพิมพ์ใหญ่)")

#ตรวจสอบคำขึ้นต้น
print(name.startswith("P"),"(ตรวจว่าเริ่มต้นด้วย P หรือไม่)") #ตรวจว่าเริ่มต้นด้วย P หรือไม่

#ตรวจสอบคำสิ้นสุด
print(name.endswith("a"),"(ตรวจว่าสิ้นสุดด้วย a หรือไม่)")#ตรวจว่าสิ้นสุดด้วย a หรือไม่

#ตรวจสอบความยาวของ String
print(len(name),"(ตรวจสอบความยาวของ String)")

#ลำดับตัวอักษรหรือ String ที่หาเจอ
print(name.find("w"),"(ลำดับตัวอักษรหรือ String ที่หาเจอ)")#หาตัวอักษร w ว่าอยู่ที่ไหน

#ลำดับตัวอักษรหรือ String ที่หาเจอ จากข้างหลัง
print(name.rfind("w"),"(ลำดับตัวอักษรหรือ String ที่หาเจอ จากข้างหลัง)")

#นับจํานวนตัวอักษรที่ซ้ำกันใน String
print(name.count("a"),"(นับจํานวนตัวอักษร a ใน String ว่ามีกี่ตัว)")#นับจํานวนตัวอักษร a ใน String ว่ามีกี่ตัว

#แทนที่ String
print(name.replace("Pawarisa","ปวาริษา"),"(แทนที่ String)")

print("-------------------------------------------------------------------")

#*******************8
#ตรวจสอบคำนำหน้าชื่อแล้วบอกว่าชื่อนั้นเป็นชื่อชายหรือหญิง

name= input("กรุณาป้อนชื่อของคุณ:")

if name.startswith("นาย"):
    print("เป็นเพศชาย")
elif name.startswith("นางสาว"):
    print("เป็นเพศหญิง")
elif name.startswith("นาง"):
    print("เป็นเพศหญิง")
else:
    print("ไม่รู้")
    

print("-------------------------------------------------------------------")

#*******************88
#ตรวจสอบเดือนว่าลงท้ายด้วยอะไร เช่น ยน,คม,พัน

mouth= input("กรุณาป้อนเดือน:")

if mouth.endswith("ยน"):
    print("เดือนนี้มี30วัน")
elif mouth.endswith("คม"):
    print("เดือนนี้มี31วัน")
elif mouth.endswith("พัน"):
    print("เดือนนี้มี28วัน")
else:
    print("เดือนนั้นไม่ลงท้ายด้วย ยน,คม,พัน")
    
print("-------------------------------------------------------------------")
#*******************9
#ทำระบบค้นหาคำ
text="Hello Python"

print(text.find("Python"),"(ลำดับตัวอักษรหรือ String ที่หาเจอ)")#หาคำว่า Python อยู่ที่ไหน
#ถ้าหาไม่เจอจะขึ้นคำว่า -1

print(text.rfind("Python"),"(ลำดับตัวอักษรหรือ String ที่หาเจอ จากข้างหลัง)")
#นับจํานวนตัวอักษรที่ซ้ำกันใน String
print(text.count("o"),"(นับจํานวนตัวอักษร o ใน String ว่ามีกี่ตัว)")

#ค้นคนว่า คุณ กี่ตัว
text="สวัสวดี คุณป้า คุณน้า คุณหญิง คุณชาย คุณยาย คุณตา"
print(text.count("คุณ"),"(นับจํานวนตัวอักษร คุณ ใน String ว่ามีกี่ตัว)")

#ฟังก์ขั่นแทนที่คำ
text="สัญญาจ้างงานประจำปี 2567 มีผลตั้งแต่ มกราคม 2567 ถึง ธันวาคม 2567"
print(text,"ข้อความเดิม")
update= text.replace("2567","2568")
print(update,"ข้อความใหม่")

# ฟังก์ลบช่องว่างซ้ายขวา
text="python"
print(len(text),"จำนวนตัวอักษร")
#ลบช่องว่าง
print(text.lstrip(),"ลบช่องว่างซ้าย") #left strip
print(text.rstrip(),"ลบช่องว่างขวา")#right strip
print(text.strip(),"ลบช่องว่างซ้ายขวา")#both strip
#หรือ
text1="  python  ".strip() #strip คือลบช่องว่างทั้งหน้าและทั้งหลัง
print(len(text1),"จำนวนตัวอักษรที่ลบช่องซ้ายและช่องว่างขวาออกแล้ว")
print("-------------------------------------------------------------------")
#*******************10
#ฟังก์ชั่นจัดรูปแบบ string
text = "ฉันชื่อ {0} อายุ {1}  ปี".format("ปวาริษา",22) #เขียนตามลําดับ
print(text)

#ถ้าเขียนลำดับผิด
text = "ฉันชื่อ {1} อายุ {0}  ปี".format("ปวาริษา",22) #เขียนตามลําดับ
print(text)