#ตัวดำเนินการเปรียบเทียบ เอาไปกับif-else
# -*- coding: utf-8 -*-


# #คำสั่งเปลี่ยนเป็นภาษาไทย
# import sys
# import io 

# sys.stdout = io.TextIOWrapper(sys.stdout.buffer, encoding='utf-8')
# print("เปลี่ยนเป็นภาษาไทย")

x,y=100,50
#เปรียบเทียบ เท่ากับ
print(x==y)
print("_______________________________")
#เปรียบเทียบ ไม่เท่ากับ
print(x!=y)
print("_______________________________")
#เปรียบเทียบ มากกว่า
print(x>y)
print("_______________________________")
#เปรียบเทียบ น้อยกว่า
print(x<y)
print("_______________________________")
#เปรียบเทียบ มากกว่าเท่ากับ
print(x>=y)
print("_______________________________")
#เปรียบเทียบ น้อยกว่าเท่ากับ
print(x<=y)
print("_______________________________")



#     #วิธี run คือ python program9.py
# #หรือ กด วิธีที่ 1: ใช้ Terminal แทนการกด Run ปกติ
# เปิดไฟล์ .py

# กดขวาบนไฟล์ แล้วเลือก
# ✅ "Run Python File in Terminal" (อย่ากดปุ่ม ▶ ด้านบน)