#Dintionary

#สร้าง dictionary จะทำคล้ายๆ list แต่จะมี key และ value

#สร้าง dictionary แบบ1
color = {
    "red":"แดง",
    "yellow":"เหลือง",
    "green":"เขียว"
    }
print(color)
#วิธีหยิบข้อมูลที่ต้องการมาใช้งาน
print(color["red"])
#ลองสีอื่น
print(color["green"])
#ต้องการเพิ่มข้อมูลใน dictionary
color["black"] = "ดํา" #โดยไม่ซ้ำกับอันที่มีอยู่แล้ว
print(color)
#ต้องการเปลี่ยนข้อมูลใน dictionary
color["black"] = "เทา" #แก้ไขข้อมูลที่มีอยู่แล้ว
print(color)
#เช็คชนิดข้อมูล
print(type(color))
#เช็คจํานวนข้อมูล
print(len(color))

print("-------------------------------------------------------------------")
#สร้าง dictionary แบบ2   
color2 = dict(
    red="แดง",
    yellow="เหลือง",
    green="เขียว")
print(color2)
#เช็คชนิดข้อมูล
print(type(color2))


print("-------------------------------------------------------------------")
#สร้าง dictionary แบบ3
color3 = dict([
    ("red","แดง"),
    ("yellow","เหลือง"),
    ("green","เขียว")
    ])
print(color3)
#เช็คชนิดข้อมูล
print(type(color3))

print("-------------------------------------------------------------------")

#**************888
#สร้าง dictionary ขี้นมาใหม่
confirm={
    True:"ยืนยัน",
    False:"ยกเลิก"
}
print(confirm)
#ถ้าอยากได้ key ยืนยันมาใช้งาน
print(confirm[True])
#ถ้าอยากได้ key ยกเลิกมาใช้งาน
print(confirm[False])

print("-------------------------------------------------------------------")
#ยกตัวอย่าง key ที่มีจำนวนเต็ม เช่น เดือน
month={
    1:"มกราคม",
    2:"กุมภาพันธ์",
    3:"มีนาคม",
    4:"เมษายน",
    5:"พฤษภาคม",
    6:"มิถุนายน",
    7:"กรกฎาคม",
    8:"สิงหาคม",
    9:"กันยายน",
    10:"ตุลาคม",
    11:"พฤศจิกายน",
    12:"ธันวาคม"
}
print(month)

print("-------------------------------------------------------------------")
#************88
#อยากเก็บข้อมุลแบบ listเป็นตัวเลข เป็นเลขคู่และเลขคี่
number={
    "เลขคู่":[2,4,6,8,10],
    "เลขคี่":[1,3,5,7,9]
}
print(number["เลขคี่"])

print("-------------------------------------------------------------------")

