#nested-if
username = input("กรุณาป้อนชื่อผู้ใช้: ")
password = input("กรุณาป้อนรหัสผ่าน: ")

if username == "member" and password == "1234": #เงื่อนไขหลัก
        print("เข้าสู่ระบบสําเร็จ")
        sevice = input("ป้อนหมายเลขบริการ: ") #ตัวที่เอาไว้ใช้ในเงื่อนไขย่อย เพื่อเช็คว่าป้อนหมายเลขบริการอะไร
        if sevice == "1": #เงื่อนไขย่อย
                print("ฝากเงิน")
        elif sevice == "2": #เงื่อนไขย่อย
                print("ถอนเงิน")
        else: #เงื่อนไขย่อย
                print("หมายเลขบริการไม่ถูกต้อง")
            
else:
        print("ไม่พบบัญชีผู้ใช้")
        
