#ตัวดำเนินการเปรียบเทียบ เอาไปกับif-else
x,y=100,50
#เปรียบเทียบ เท่ากับ
print(x==y)
print("_______________________________")
#เปรียบเทียบ ไม่เท่ากับ
print(x!=y)
print("_______________________________")
#เปรียบเทียบ มากกว่า
print(x>y)
print("_______________________________")
#เปรียบเทียบ น้อยกว่า
print(x<y)
print("_______________________________")
#เปรียบเทียบ มากกว่าเท่ากับ
print(x>=y)
print("_______________________________")
#เปรียบเทียบ น้อยกว่าเท่ากับ
print(x<=y)
print("_______________________________")



