#การสร้างตัวแปร และ ชนิดของข้อมูล

#เก็บข้อมูลนักเรียน(input)

#เขียนแบบธรรมดา
#name="เอ๊ะ"
#age=22
#grade = 2.5 #เว้นวรรคทีละ1
#status = True #trueคือกำลังศึกษาอยู่,falseคือเรียนจบแล้ว

#สร้างตัวแปรหลายตัวแปรในบรรทัดเดียว
name,age,grade,status = "เอ๊ะ",22,2.5,True

#แก้ไขข้อมูล
age=23
grade=3.10

#แสดงข้อมูล (output)
print("ชื่อนักเรียน = ",name)
print("อายุ = ",age," ปี")
print("เกรด = ",grade)
print("สถานะ = ",status)

#แสดงชนิดข้อมูล
print(type(name),"ชนิดของชื่อ")
print(type(age),"ชนิดชองอายุ")
print(type(grade),"ชนิดของเกรด")
print(type(status),"ชนิดของสถานะ")
#หรืออยากตรวจสอบข้อมูลว่าเป็นชนิดอะไรก็โยนข้อมูลเข้าไปเลย ,ไม่จำเป็นว่าต้องเก็บลงตัวแปรอย่างเดียว
print(type(3.10),"ทดสอบเช็คชนิดของเกรด")

