#การรับข้อมูลจากผู้ใช้(input)จากคีย์บอร์ด
#และการแปลงชนิดของข้อมูล
# -*- coding: utf-8 -*-

name = input("กรุณาป้อนชื่อของคุณ:")#ใน()จะรอรับการป้อนข้อมูลเข้าไปที่หน้าต่างแสดงผล
#year = input("กรุณาป้อนปีเกิดของคุณ (พ.ศ.):")
#แปลงข้อมูลyearให้เป็น int แบบถาวรเลย
year = int(input("กรุณาป้อนปีเกิดของคุณ (พ.ศ.):"))


print("ชื่อของคุณ = ",name)
print("ปีเกิด = ",year)
#ลองคำนวณอายุในเรื่องการแปลงชนิดข้อมูล
#print("ปีนี้คุณอายุ : ",2568-int(year),"ปี")#แปลงชนิดข้อมูลเพื่อการคำนวณแล้ว

#กรณีแปลงข้อมูลถาวรในบรรทัดที่ 6 ไปแล้ว ให้printแบบนี้
print("ปีนี้คุณอายุ : ",2568-year,"ปี")

#เช็คชนิดข้อมูล
print(type(name))
print(type(year))#yearชนิดข้อมูลเดิม
