#Listสามารถเปลี่ยนค่าได้ , สามารถเพิ่มค่าได้,เก็บกลุ่มข้อมูลได้

#เก็บข้อมูลสินค้า แบบที่ 1
product = ["กางเกง",99.99,10,True]

#เก็บข้อมูลสินค้า แบบที่ 2
product = list()#แบบไม่มีข้อมูล
product = list(("กางเกง",99.99,10,True))

#ตรวจสอบชนิดข้อมูล
print(type(product),"ทดสอบเช็คชนิดข้อมูล")

#ตรวจสอบว่ามีข้อมูลกี่ตัว
print(len(product),"ทดสอบเช็คจํานวนข้อมูล")

#การเข้าถึงข้อมูล แบบซ้ายไปขวา
print(product[0])#ข้อมูลตัวแรก ,มองจากข้างหน้าไปข้างหลัง

print(product[1])#ข้อมูลตัวที่ 2
print(product[2])#ข้อมูลตัวที่ 3
print(product[3])#ข้อมูลตัวที่ 4

#การเข้าถึงข้อมูล แบบขวาไปซ้าย
print(product[-1])#ข้อมูลตัวสุดท้าย ,มองจากข้างหลังไปข้างหน้า

print(product[-2])#ข้อมูลตัวที่ 2
print(product[-3])#ข้อมูลตัวที่ 3
print(product[-4])#ข้อมูลตัวที่ 4

print("-------------------------------------------------------------------")
#ถ้าอยากดึงข้อมูลทกตัว
for element in product: #elementคือชื่อตัวแปร
    print(element)  
#ถ้าอยากแทรกแก้ไขข้อมูล เช่นอยากเปลี่ยนข้อมุล จาก กางเกงเป็นเสื้อ

product[0] = "เสื้อ"
print(product,"แทรกแก้ไขข้อมูล")

product[1]=250
print(product,"แทรกแก้ไขข้อมูล ราคา")

print("-------------------------------------------------------------------")
#***********888
#สร้างlist เก็บกลุ่มของสี note ;liistเก็บข้อมูลซ้ำกันได้

color = ["แดง","เหลือง","เขียว"]#แบบ1
color2=list(("ขาว","ฟ้า","ส้ม")) #แบบ2
#รวมlist ในตัวแปรชื่อ fullcolors
fullcolors=color+color2
print(fullcolors,"รวมlist ในตัวแปรชื่อ fullcolors")
#เช็คชนิดข้อมูล
print(type(fullcolors),"ทดสอบเช็คชนิดข้อมูล")
#เช็คจํานวนข้อมูล
print(len(fullcolors),"ทดสอบเช็คจํานวนข้อมูล")

print("-------------------------------------------------------------------")

#เข้าถึงข้อมูลในlistแบบกำหนดช่วง

color3=["แดง","เหลือง","เขียว","ดํา","ขาว","ฟ้า","ส้ม"]

#ทำจากข้างหน้าไปข้างหลัง
print(color3[2],"เขียว")#อยากได้สีเขียว
#อยากได้สีดำกับขาว
print(color3[3:5],"ดํากับขาว")#การเข้าถึงข้อมูลในlistแบบกำหนดช่วง
#อยากได้สีดำกับขาวและส้ม
print(color3[3:6],"ดํากับขาวและส้ม")

#อยากได้ตั้งแต่เริ่มต้นถึงสีเขียว
print(color3[:3])#0-2
#ทำจากข้างหลังไปข้างหน้า
print(color3[-3],"ขาว")
print(color3[-6:-2],"ดํากับขาว")
print(color3[-6:],"ดํากับขาวและส้ม")
#อยากได้ตั้งแต่เริ่มต้นถึงตำแหน่งสุดท้าย
print(color3[:])
#อยากได้ตั้งแต่ตำแหน่งสุดท้าย
print(color3[-1:])

print("-------------------------------------------------------------------")

#เข้าถึงข้อมูลแบบกำหนดช่วงจุดเริ่มต้นกับจุดสิ้นสุด

color4=["แดง","เหลือง","เขียว","ดํา","ขาว","ฟ้า","ส้ม"]
#แดง = 0,เหลือง = 1,เขียว = 2,ดํา = 3,ขาว = 4,ฟ้า = 5,ส้ม = 6 แบบหน้าไปหลัง
#แดง = -7,เหลือง = -6,เขียว = -5,ดํา = -4,ขาว = -3,ฟ้า = -2,ส้ม = -1
#ทำจากข้างหน้าไปข้างหลัง
print(color4[2:5])#เขียว,ดํา,ขาว ,เราอยากได้ข้อมูลตรงกลาง
#ทำจากข้างหลังไปข้างหน้า
print(color4[-4:-1])#ดํา,ขาว,เราอยากได้ข้อมูลตรงกลาง
#อยากได้ดำ,ขาว,ฟ้า,ส้ม
print(color4[-4:])#ดํา,ขาว,ฟ้า,ส้ม
