#เจาะลึก String

#เอาข้อความต่อกัน
firtname = "ปวาริษา"
lastname = "รัตนเทียนทอง"

fullname = firtname + " " + lastname +" ( เอ๊ะ )"
print(fullname)

#การสร้างSringหลายบรรทัด เก็บแบบ string ใส่ " 3 ครั้งหรือ 3ตัว หรือ ' 3 ครั้งหรือ 3ตัว ใช้งาน ได้เหมือนกัน
address ="""

ีที่อยู่ 88/28
หมู่ 3
ซอยเพชรเกษม
แยก 14
เขตบางคอแหลม

"""
print(address)

#f-string คือการจัดข้อความใน String ให้แทรกข้อมูลได้
year=2546
salary=25000
message=f"เกิดเมื่อปี พ.ศ.{year}" #f"เกิดเมื่อปี พ.ศ.{year}"คือ f-stringคือการแปลงข้อมูลให้เป็น String
age=f"ปีนี้คุณอายุ : {2568-year} ปี"
data=f"เงินเดือนของฉัน = {salary:.2f} บาท" #{salary:.2f}คือการแปลงข้อมูลให้เป็น float และมีทศนิยม 2 ตัว
print(age)
print(message)
print(data)

print("--------------------")
#การเข้าถึงตัวอักษรใน String

text="ปวาริษา" #ป =0, ว =1, า =2, ร =3, ิ =4, ษ =5, า =6 มองแบบหน้าไปหลัง 
#ถ้ามองหลังไปหน้า คือ ป =-7, ว =-6, า =-5, ร =-4, ิ =-3, ษ =-2, า =-1

#เราต้องตรวจสอบก่อนว่าตัวแปร text มีตัวอักษรกี่ตัว
print(len(text))

#ดึงตัวอักษรที่ต้องการ แบบเจาะจง โดยการระบุเลข index
#นับ index จากหน้าไปหลัง 
print(text[0])#ป
#จากหลังไปหน้า
print(text[-7])#ป

print("--------------------")

#ถ้าต้องการดึงทุกตัวเลขให้ใช้ loop
for i in text : #text คือ ปวาริษา 
    print(i)#ปริ้นเรียงลงมา
    
print("--------------------")

#การเข้าถึงตัวอักษรใน Stringแบบกำหนดช่วง
#หยิบแบบหน้าไปหลัง จาก0-ตัวสุดท้าย
print(text[:3])#ปวา
print("--------------------")
print(text[3:])#ริษา
print("--------------------")
#หยิบแบบหลังไปหน้า จากตัวสุดท้าย(-1)-ตัวแรก
print(text[-1:])#า
print("--------------------")
print(text[:-3])#ปวาริ
print("--------------------")
print(text[-3:])#ษา
print("--------------------")

#การเข้าถึงตัวอักษรแบบกำหนดจุดเริ่มต้นและจุดสิ้นสุด
#นับindex จากหน้าไปหลัง
print(text[0:4])#ปวาริ
print("-------------")
print(text[3:7])#ริษา
#นับindex จากหลังไปหน้า
print(text[-5:-1])#ษา
print("-------------")
