#Raise Exception
#ถ้าเราอยากกำหนดปัญหาข้อผิดพลาดในการทำงาน ให้เราใช้ raise Exception
#แบบ except ValueError คือ ปัญหาข้อผิดพลาดเกี่ยวกับตัวอักษร มันมีให้ใช้อยู่ ถ้าเรากำหนดเองก็ใช้ในเรื่องของ raise


try:
    nember1=int(input("ป้อนตัวเลขที่1: "))
    nember2=int(input("ป้อนตัวเลขที่2: "))
    #นำมาแก้ไขปัญหาตรงนี้ด้วย raise เพื่อแก้ปัญหาเลขที่เข้ามาต้องเป็นค่าบวกเท่านั้น
    if nember1<0 or nember2<0:
        raise Exception("ข้อมูลตัวเลขต้องเป็นค่าบวกเท่านั้น!")   
        #ในวงเล็บคือ ข้อความที่จะแสดงออกมา #ภายในนี้คือข้อมูลรายละเอียด
    
    result= nember1/nember2
    print("ผลลัพธ์ = ",result)
except ValueError: #ValueError คือ ปัญหาข้อผิดพลาดเกี่ยวกับตัวอักษร
    print("ข้อมูลไม่ถูกต้อง กรุณาป้อนข้อมูลเฉพาะตัวเลขเท่านั้น")
except ZeroDivisionError: #ZeroDivisionError คือ ปัญหาข้อผิดพลาดเกี่ยวกับตัวเลขที่2เป็น0
    print("ไม่สามารถหารด้วย 0 ได้! เนื่องจากไม่ถูกนิยามในทางคณิตศาสตร์")
    
##หรือ เราใส่ 
#except:
#    print("เกิดข้อผิดพลาดในการทำงาน")
##ก็ได้
    
finally:
    print("--------------------")
    print("สิ้นสุดการทำงาน")
    print("--------------------")