#Mapping Pattern ,เป็นการกำหนดกระบวนกับข้อมูลในการทำงานที่อยู่ในรูปแบบ dictionary 
# หรือเป็นการตรวจสอบภายในรูปแบบ dictionary โดยกำหนดการทำงานภายในตัว match case

#เป็นการเอาค่าที่อยู่ในตัวแปรมาเป็น key และถ้าค่าที่อยู่ในตัวแปรเป็น value

#สมมติว่า ไม่ได้แค่รายการเดียว ให้เราสร้างlistขึ้นมาชื่อตัวแปรว่า customer
customer = [
    {"name":"จุมิ","type":"Member"},
    {"name":"โคล่า","type":"Member"},
    {"name":"เซเว่น","type":"general"},
    {"name":"เจ๊น","type":"general"}
]
#จะให้พนักงานตรวจสอบว่าเป็นสมาชิกหรือไม่หรือเป็นลูกค้า โดยจะตรวจสอบด้วยรหัสลูกค้า
#สร้างรหัส id ของลูกค้า และให้เราสร้าง list ขึ้นมาชื่อ id

id=int(input("ป้อนรหัสลูกค้า : "))
print(f"สวัสดีลูกค้ารหัส {id} : {customer[id]['name']}")

# #ทำการตรวจสอบว่าเป็นสมาชิกหรือไม่
# data={"name":"ปวาริษา","type":"Member"} #เป็นแบบdictionary คือ data = {" ",...}
# #ใช้ mapping pattern มาใช้เพื่อตรวจสอบว่าเป็นสมาชิกหรือไม่

# data={"name":"ปวาริษา","type":"general"}#กรณีไม่เป็นสมาชิก ใช้คำว่า general

match customer[id]:
    case {"type":"Member"}:
        print("คุณเป็นสมาชิกได้รับส่วนลด 50%")
    case _:
        print("ไม่ได้รับส่วนลด")