#Funtion แบบมีค่าส่งกลับ ,return function
#มันการสร้างfunctionแบบทั่วไปเลย เลยแต่แค่ ภายในฟังก์ชั่นจะมีค่าส่งกลับออกมาด้านนอกfunction

#ลองทำสร้างฟังก์ชั่นที่มีค่าส่งชื่อเมืองหลวงออกไป ทำงานด้านนอกฟังก์ชัน
def getCapital(): #ชื่อฟังก์ชัน
    return"กรุงเทพมหานคร" #ค่าส่งกลับคือ กรุงเทพมหานคร เปลี่ยนค่าได้ 


#ส่งค่าเป็นตัวเลขได้ด้วย จะเอาค่าไปใช้ในการคํานวณ
def getPI(): #ชื่อฟังก์ชัน
    return 3.14159 #ค่าส่งกลับคือ 3.14159

#เรียกใช้ฟังก์ชัน
#ต้องมีการสร้างที่เก็บข้อมูล
mycapital = getCapital() #เก็บค่าส่งกลับไว้ในตัวแปร mycapital
print("เมืองหลวงของฉัน คือ ",mycapital)

#ในส่วนของพื้นที่วงกลม
##area =PI*radius**2   #สูตรคํานวณพื้นที่วงกลม 

#เรียกใช้ฟังก์ชัน
radius =  5 #เก็บค่าไว้ในตัวแปร radius ,เก็บค่าเป็นตัวเลข
area = getPI()*radius**2 # area คือ พื้นที่วงกลม ,radius คือรัศมีวงกลม ,getPI คือ เรียกใช้ฟังก์ชัน,**2 คือ เลขยกกําลังสอง
print("พื้นที่วงกลมของฉัน =  ",area," ตารางเมตร")