#OR Pattern
#คือการใช้ or operator(คือตัวดำเนินการทางตรรกยะฝศาสตร์) ในการเปรียบเทียบข้อมูล
data =input("ป้อนคำนำหน้าของคุณ : ")

#เขียนแบบธรรมดา
match data:
    case "นาย":  
        print("เป็นเพศชาย")
    case "นาง":
        print("เป็นเพศหญิง")
    case "นางสาว": 
        print("เป็นเพศหญิง")
    case _:
        print("ไม่พบข้อมูล")
        
print("\n")   #คำสั่งข้ามบรรทัด หรือ ขี้นบรรทัดใหม่
#เขียนแบบสัญลักษณ์ or      
match data:
    case "นาย" | "เด็กชาย": #| คือ OR มันคือสัญลักษณ์ OR ในการเปรียบเทียบข้อมูล
        print("เป็นเพศชาย")
    case "นาง" | "เด็กหญิง" | "นางสาว":
        print("เป็นเพศหญิง")
    case _:
        print("ไม่พบข้อมูล")