#Wildcard Pattern

#เอาความรู้ Literal Pattern มาเพิ่มเติม
#เอาไว้ตรวจสอบค่าตัวแปร
#ลองทำระบบฝากเงิน เช่น 1 คือการฝากเงิน 2 คือการถอนเงิน

service = int(input("กรุณาเลือกบริการ 1.ฝากเงิน 2.ถอนเงิน 3.สอบถามยอดเงินคงเหลือ: "))
#หรือใช้คำสั่ง service = 1หรือ 2หรือ 3 หรือเขียน service = none คือไม่ระบุค่า
match service:
    case 1: #ถ้าค่าที่อยู่ใน service เป็นเลข1คือ ฝากเงิน
        print("ฝากเงิน")
    case 2:#ถ้าค่าที่อยู่ใน service เป็นเลข2คือ ถอนเงิน
        print("ถอนเงิน")
    case 3:#ถ้าค่าที่อยู่ใน service เป็นเลข3คือ สอบถามยอดเงินคงเหลือ
        print("สอบถามยอดเงินคงเหลือ")
        
#**** มันคือ wildcard pattern ถ้าค่าที่อยู่ใน service ไม่เป็นเลข1,2,3 ให้ใช้คำสั่ง case _:
    case _: #ถ้าค่าที่อยู่ใน service เป็นเลขอื่นๆ ,มันคือ default case หรือcase เริ่มต้น
        print("ข้อมูลไม่ถูกต้อง") 
        
