#Capture  Pattern ,มันคือการเอาชื่อในตัวแปรมาอ้างอิงการทำงานภายในพื้นที่  match caseของเรา

#เอาความรู้ Wildcard Pattern มาใช้ด้วย
#เอาความรู้ Literal Pattern มาเพิ่มเติม
#เอาไว้ตรวจสอบค่าตัวแปร
#ลองทำระบบฝากเงิน เช่น 1 คือการฝากเงิน 2 คือการถอนเงิน

service = int(input("กรุณาเลือกบริการ 1.ฝากเงิน 2.ถอนเงิน 3.สอบถามยอดเงินคงเหลือ: "))
#หรือใช้คำสั่ง service = 1หรือ 2หรือ 3 หรือเขียน service = none คือไม่ระบุค่า
match service:
    case 1: #ถ้าค่าที่อยู่ใน service เป็นเลข1คือ ฝากเงิน
        print("ฝากเงิน")
    case 2:#ถ้าค่าที่อยู่ใน service เป็นเลข2คือ ถอนเงิน
        print("ถอนเงิน")
    case 3:#ถ้าค่าที่อยู่ใน service เป็นเลข3คือ สอบถามยอดเงินคงเหลือ
        print("สอบถามยอดเงินคงเหลือ")
        
#**** มันคือ wildcard pattern ถ้าค่าที่อยู่ใน service ไม่เป็นเลข1,2,3 ให้ใช้คำสั่ง case _:
    # case _: #ถ้าค่าที่อยู่ใน service เป็นเลขอื่นๆ ,มันคือ default case หรือcase เริ่มต้น
    #     print("หมายเลขบริการไม่ถูกต้อง") 
        
    #*******capture pattern มาเขียนในกรณี ถ้าค่าที่อยู่ใน service มากกว่า 3 มาเขียนแทน case _:
    case service if service > 3:
        print(f"ไม่มีบริการหมายเลข {service} ในระบบ กรุณาทำรายการใหม่อีกครั้ง!")    
        #f {service} คือการแสดงค่าตัวแปรใน string ที่อยู่ใน serviceที่เราใส่เข้ามาตอนinput

