#Guard Filter หรือตัวกรองข้อมูล
#จะนำความรู้ ในเรื่อง ของ Match Case Statement มาทำงานร่วมกับ if statement ในการกำหนดช่วงข้อมูล ภายในcaseของเรา

#เขียนโปรแกรมตัดเกรดบอกเกรดตามคะแนนสอบของคุณ
#100 = สอบได้คะแนนเต้ม , 50-99 = ผ่านเกณฑ์การสอบวัดผล

score=int(input("กรุณาป้อนคะแนนสอบของคุณ (50-100): ")) #รับข้อมูลผ่านคีย์บอร์ด ใส่ในตัวแปรscore
print("คะแนนสอบของคุณ คือ ",score) #แสดงคะแนนสอบของคุณผ่านตัวแปรscoreฃ

match score :
    case 100:
        print("สอบได้คะแนนเต็ม")
    case score if score>=50 and score<100: #Guard Filter 
        print("ผ่านเกณฑ์การสอบวัดผล")
    case _:
        print("คะแนนไม่อยู่ในเกณฑ์ที่กำหนด")
        
    
