#Funtion แบบรับค่าและส่งค่า

#para + return function ************

#ลองทำฟังก์ชันที่ตรวจสอบข้อมูลตัวเลข โดยจะให้ส่งข้อมูลตัวเลขเข้ามาทำงานในฟังก์ชัน แล้วให้ตวจสอบว่า เป็นเลขคู่หรือเลขคี่ แล้วส่งค่ากลับออกมา

def checknumber(number): #ชื่อฟังก์ชัน
    if number%2==0: #เช็คว่าเป็นเลขคู่หรือเลขคี่
        return "เลขคู่"
    else: #ถ้าเป็นเลขคี่
        return "เลขคี่"
    
#เรียกใช้ฟังก์ชัน
#สร้างตัวแปรมาเก็บผลลัพธ์
reslt = checknumber(10)#เลข 10 คือ ที่เราจะส่งเข้ามาในฟังก์ชันchecknumber แล้วเก็บไว้ในตัวแปร reslt
print(reslt)

print("-------------------------------------------------------------------")
#Funtion ที่เอาไว้คำนวณผลรวมของตัวเลข
def summation(*args): #สร้างฟังก์ชันชื่อ summation ที่รับค่ามาเป็นจํานวนไม่จํากัด ,*args คือตัวแปรส่งแบบลำดับ
    total = 0 #สร้างตัวแปร total เพื่อเก็บผลรวม
    for item in args:
        total += item #คือ total = total + item
    return total
    
#เรียกใช้ฟังก์ชัน
print(summation(10,20))
print(summation(10,20,30))
#ถ้าอยากนำเอาผลไปใช้ส่วนอื่น แนะนำว่าให้สร้างตัวแปรมาเก็บเหมือนในกรณีของ result = checknumber(10) print(result)
# เราสามารถนำเอา result ไปใช้ได้ในส่วนอื่นนอกจากเอาไปprint แต่ถ้าอยากใช้งานแค่ครั้งเดียว ให้ print(checknumber(10)) 
# หรือ checknumber(10) คือเรียกใช้งานได้เลย

    