#Sequence Pattern ,ทำงานเกี่ยวข้องกับลำดับ  หรือ เกี่ยวกับ list กับ tuple 
#ใช้ list หรือ tuple ก็ได้ในการเก็บข้อมูล 
# data = [] #list กรณีไม่มีค่าเริ่มต้น จะใส่เป็น data = [1] ก็ได้
# data = () #tuple กรณีไม่มีค่าเริ่มต้น จะใส่เป็น data = (1) ก็ได้

#ทำแบบ list
data = [1,2] #กรณีไม่มีค่าเริ่มต้น หรือจะใส่เป็น data = [1] หรือ data = [1,2,3]ก็ได้ 
match data:
    case []:
        print("ไม่มีข้อมูล")
    case [1,2]:
        print("มีข้อมูล 2 รายการ คือ 1 และ 2")
    case [1,2,3]:
        print("มีข้อมูล 3 รายการ คือ 1 2 และ 3")
    case _:
        print("มีข้อมูลมากกว่า 3 รายการ")
        
#ทำแบบ tuple
# data = () #กรณีไม่มีค่าเริ่มต้น หรือจะใส่เป็น data = (1) หรือ data = (1,2,3)
# match data:
#     case ():
#         print("ไม่มีข้อมูล")
#     case (1,2):
#         print("มีข้อมูล 2 รายการ คือ 1 และ 2")
#     case (1,2,3):
#         print("มีข้อมูล 3 รายการ คือ 1 2 และ 3")
#     case _:
#         print("มีข้อมูลมากกว่า 3 รายการ")