#Lambda Fuuntion
#การสร้างฟังก์ชันแบบไม่มีชื่อ
# lambda arguments : expression

#เราจพยกตัวอย่างกับฟังก์ชันที่มีชื่อและไม่มีชื่อ
#เราจะสร้างฟังก์ชั่นที่ให้บริการเกี่ยวกับการหาเลชยกกำัง หรือคำนวณเลขยกกำลัง โดยให้ชื่อฟังก์ชันเป็น power

#ฟั่งก์ชั่นแบบมีชื่อ
#lambda function 2^3
def power(base,n): #ฟังก์ชันหาเลขยกกำลัง ,base คือ เลขฐาน,n คือ ยกกำลัง
    return base**n

result = power(2,3) #เรียกใช้ฟังก์ชันและเก็บผลลัพธ์ไว้ในตัวแปร result 
print("ผลลัพธ์ ",result)
print("--------------------")

#ฟังก์ชันแบบไม่มีชื่อ
#ไม่จำเป็นต้องสร้างฟังก์ชันก่อน ใช้ lambda ได้เลย
#lambda function 2^3

#คือ 
# ชื่อตัวแปร = เรียกใช้ lambda และต่อด้วย parameters ตามจำนวนที่เราต้องการส่งเข้าไป เช่น base,n : expression คือกระบวนการที่เราต้องการทํา
#กระบวนการทั้งหมดจะถูกเก็บในตัวแปร result
result = lambda base,n : base**n #เรียกใช้ฟังก์ชันและเก็บผลลัพธ์ไว้ในตัวแปร result 
print("ผลลัพธ์ ",result(2,3)) #result(2,3) คือการเรียกใช้ฟังก์ชัน ,2 คือเลขฐาน ,3 คือยกกำลังให้มันส่งเข้าไปที่ base,n
#หรือกำหนดเลขอื่นๆ ได้
print("ผลลัพธ์ ",result(3,3))
print("ผลลัพธ์ ",result(4,3))
print("ผลลัพธ์ ",result(5,3))

print("--------------------")