#การ สร้าง Function แบบมี กำหนดค่าเริ่มต้น (Default Parameter)

#สร้างฟังก์ชันสำหรับให้บริการบันทึกข้อมูลของพนักงานลงในระบบ

#****สิ่งที่เราต้องการทำคือ ถ้ามีการบันทึกข้อมูลพนักงาน ต้องมีการใส่ ชื่อกำกับ แผนกกำกับ เงินเดือนกำกับ เราอยากเปลี่ยนโครงสร้าง คือ
# เราจะกำหนดเงินเดือนเริ่มต้นให้พนักงานเป็น 30000 บาท เช่น salary=30000 ในฟังก์ชันparameter 
# สมมติว่า ตอนที่เรียกใช้ฟังชั่นไม่ได้ส่งเงินเดือนเข้ามาในargument เราจะใส่เงินเดือนเป็นค่าเริ่มต้น ก็คือ 30000 ลงไปแทน อัตโนมัติ****
def saveemployee(name,department,salary = 30000): #ชื่อฟังก์ชัน saveemployee คือ ฟังก์ชันสําหรับบันทึกข้อมูลพนักงาน ,
    #, name เก็บชื่อพนักงาน , department เก็บแผนก , salary เก็บเงินเดือน 
    # ****เราจะกำหนดค่าเริ่มให้ salary เป็น 30000 บาท****เพิ่มเข้าไป จากที่เรา ใส่salary ไว้ในฟังก์ชันparameter
    print(f"ชื่อพนักงาน {name} , แผนก {department}")
    print(f"เงินเดือน {salary} บาท")
    print("----------------------------------")
#------------------------------------------------------------------------------- 

#การเรียกใช้ฟังก์ชัน ทุกอันที่เราสร้าง

#สร้างฟังก์ชันสำหรับให้บริการบันทึกข้อมูลของพนักงานลงในระบบ
saveemployee("คุณเอ๊ะ","คอมพิวเตอร์")#ตัวอย่างถ้าไม่ได้ใส่เงินเดือน ใน  argument จะเป็น 30000 บาทที่เรากําหนดไว้ในฟังก์ชันparameter
saveemployee("คุณโคล่า","กราฟิก",20000)
saveemployee("คุณเซเว่น","การตลาด ",25000)
saveemployee("คุณแจน","บัญชี") #ลองเพิ่มพนักงานใหม่เข้าไปแล้วจะเงินเดือนเป็น 30000 บาทเป็นเงินเดือนเริ่มต้น****

#****argument คือ ตัวแปรส่ง , parameter คือ ตัวแปรรับ****

    