#การ สร้าง Function แบบมี parameter

#เราจะลองสร้างฟังก์ชันเพื่อทำงานง่ายๆดูก่อนเช่น
#***สิ่งที่เราต้องการเพิ่ม เช่นเราเรียกใช้ฟังก์ชัน sayhello() เราอยากที่จะแสดงข้อความ ระบุบบุคคลที่เราอยากทักทายด้วย***
#และตารางสูตรเราอยากแสดงตารางมากกว่าแม่2

#เราจะทำได้ ผ่านการส่งข้อมูลโดยนิยามเป็น parameter ให้สร้างตัวแปรในพามิเตอร์ แล้วนําไปใช้ในฟังก์ชัน
def sayhello(time ,username , age): #parameter ชื่อ username เก็บชื่อผู้ใช้ และ age เก็บอายุ และ time เก็บเวลา
    print("สวัสดีค่ะ", time, username)#กระบวนการทำงาน
    print("ปีนี้คุณมีอายุคือ", age)
    
    
#---------------------------------------------------------------
#สร้างฟังก์ชันสำหรับให้บริการบันทึกข้อมูลของพนักงานลงในระบบ
def saveemployee(name,department,salary): #ชื่อฟังก์ชัน saveemployee คือ ฟังก์ชันสําหรับบันทึกข้อมูลพนักงาน , name เก็บชื่อพนักงาน 
    #, department เก็บแผนก , salary เก็บเงินเดือน
    print(f"บันทึกข้อมูลพนักงาน {name} แผนก {department}")
    print(f"เงินเดือนของพนักงาน {name} คือ {salary} บาท")
    print("----------------------------------")
#---------------------------------------------------------------
#สร้างฟังก์ชันแสดงตารางแม่สูตรคูณ

#แม่สูตรคูณแบบ1
def showtable(): #ชื่อฟังก์ชัน
    num=int(input("ป้อนตารางแม่สูตรคูณของคุณ: "))
    print("ตารางแม่สูตรคูณ แม่",num)
    print("------------------") #ห้ามปล่อยว่างเด็ดขาด มันจะ error ให้เราใส่ คำสั่ง pass ก้ได้
    for i in range(1,13): #range(start,stop) คือ 1-12
        print(num,"x",i,"=",num*i) #number*i คือ แม่สูตรคูณ และ i คือ หมายเลขรอบคูณกับตัวเลขที่เราป้อน
        #หรือเขียนเป็น
        # print(f"{num} x {i} = {num*i}") #แบบนี้ก็ได้
    print("------------------")
    
#แม่สูตรคูณแบบกำหนดช่วง2 
def showtable2(num2): #ชื่อฟังก์ชัน
    print("ตารางแม่สูตรคูณ แม่",num2)
    print("------------------") #ห้ามปล่อยว่างเด็ดขาด มันจะ error ให้เราใส่ คำสั่ง pass ก้ได้
    for i in range(1,13): #range(start,stop) คือ 1-12
        print(f"{num2} x {i} = {num2*i}") 
    print("------------------")
#---------------------------------------------------------------

#การเรียกใช้ฟังก์ชัน ทุกอันที่เราสร้าง
# mytime="ตอนเช้า" #เราจะสร้างตัวแปรส่ง เราส่งไปที่ parameter time
sayhello("ตอนเช้า","คุณเอ๊ะ",22)  #argument คือ ข้อมูลที่ส่งให้ฟังก์ชัน และ parameter คือ ตัวแปรรับ
sayhello("ตอนบ่าย","คุณโคล่า",1)
#เราสามารถส่งได้มากกว่า 2 ตัว โดยแยกด้วย comma ,คุณโคล่าส่งไปที่ parameter username และ 1 ส่งไปที่ parameter age
sayhello("ตอนเย็น","คุณเซเว่น",1)
#แม่สูตรคูณแบบ1
showtable()  #ใส่ตัวเลขแม่สูตรคูณที่เราต้องการไปในวงเล็บ เช่น 4 เพื่อให้มันส่งไปที่ parameter num เช่น
#แม่สูตรคูณแบบ2
showtable2(4)#เปลี่ยนตัวเลขแม่สูตรคูณที่เราต้องการไปในวงเล็บ เช่น
showtable2(5)
showtable2(6)

#สร้างฟังก์ชันสำหรับให้บริการบันทึกข้อมูลของพนักงานลงในระบบ
saveemployee("คุณเอ๊ะ","คอมพิวเตอร์",30000)
saveemployee("คุณโคล่า","กราฟิก",20000)
saveemployee("คุณเซเว่น","การตลาด ",25000)

#****argument คือ ตัวแปรส่ง , parameter คือ ตัวแปรรับ****

    